// – є масив [2,17,13,6,22,31,45,66,100,-18] :
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//

//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)

// ---------------------------------1. перебрати його циклом while--------------------------------------------

// let numbers=[2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while (i < numbers.length){
//     let number=numbers[i];
//     console.log(number);
//     i++;
// }

// --------------------------------- 2. перебрати його циклом for--------------------------------------------

// let numbers=[2,17,13,6,22,31,45,66,100,-18];
// for (let j=0;j<numbers.length;j++){
//     console.log(numbers[j]);
// }

// --------------------3. перебрати циклом while та вивести  числа тільки з непарним індексом-------------------------

// let numbers=[2,17,13,6,22,31,45,66,100,-18];
// let i=1;
// while (i < numbers.length){
//     let number=numbers[i];
//     console.log(i);
//     i += 2;
// }
// ----------------------------4. перебрати циклом for та вивести  числа тільки з непарним індексом----------------

// let numbers = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 1; i <= numbers.length; i += 2) {
//     console.log(i);
// }

// -----------------------------------5. перебрати циклом while та вивести  числа тільки парні  значення---------------------
let numbers=[2,17,13,6,22,31,45,66,100,-18];
let i=1
while (i % 2 === 0){
        console.log(number);
    }

//-------------------- 6. перебрати циклом for та вивести  числа тільки парні  значення---------------------------------------
// let numbers = [2,17,13,6,22,31,45,66,100,-18];
// for (let number of numbers) {
//     if (number % 2 === 0) {
//         console.log(number);
//     }
// }




